{
  "users": [
    {
      "login": "user01",
      "password": "pass01"
    },
    {
      "login": "user02",
      "password": "pass02"
    },
    {
      "login": "user03",
      "password": "pass03"
    },
    {
      "login": "user04",
      "password": "pass04"
    },
    {
      "login": "user05",
      "password": "pass05"
    }
  ],
  "favorites": [
      {
        "userId": "user01",
        "copyright": "Ivan Eder",
        "date": "2018-08-30",
        "explanation": "A study in contrasts, this colorful skyscape features stars, dust, and glowing gas in the vicinity of NGC 6914. The complex of reflection nebulae lies some 6,000 light-years away, toward the high-flying northern constellation Cygnus and the plane of our Milky Way Galaxy. Obscuring interstellar dust clouds appear in silhouette while reddish hydrogen emission nebulae, along with the dusty blue reflection nebulae, fill the cosmic canvas. Ultraviolet radiation from the massive, hot, young stars of the extensive Cygnus OB2 association ionize the region's atomic hydrogen gas, producing the characteristic red glow as protons and electrons recombine. Embedded Cygnus OB2 stars also provide the blue starlight strongly reflected by the dust clouds. The nearly 1 degree wide telescopic field of view spans about 100 light-years at the estimated distance of NGC 6914.",
        "hdurl": "https://apod.nasa.gov/apod/image/1808/NGC6914_Eder.jpg",
        "media_type": "image",
        "service_version": "v1",
        "title": "The NGC 6914 Complex",
        "url": "https://apod.nasa.gov/apod/image/1808/NGC6914_Eder_1024.jpg"
      },
      {
        "userId": "user01",
        "date": "2021-02-20",
        "explanation": "Slung beneath its rocket powered descent stage Perseverance hangs only a few meters above the martian surface, captured here moments before its February 18 touchdown on the Red Planet. The breath-taking view followed an intense seven minute trip from the top of the martian atmosphere. Part of a high resolution video, the picture was taken from the descent stage itself during the final skycrane landing maneuver. Three taut mechanical cables about 7 meters long are visible lowering Perseverance, along with an electrical umbilical connection feeding signals (like this image), to a computer on board the car-sized rover. Below Perseverance streamers of martian dust are kicked-up from the surface by the descent rocket engines. Immediately after touchdown, the cables were released allowing the descent stage to fly to a safe distance before exhausting its fuel as planned.",
        "hdurl": "https://apod.nasa.gov/apod/image/2102/rover_drop.jpg",
        "media_type": "image",
        "service_version": "v1",
        "title": "Perseverance: How to Land on Mars",
        "url": "https://apod.nasa.gov/apod/image/2102/rover_drop1024.jpg"
      },
      {
        "userId": "user01",
        "date": "2013-11-12",
        "explanation": "What is happening to asteroid P/2013 P5? No one is sure. For reasons unknown, the asteroid is now sporting not one but six discernible tails. The above images were taken two months ago by the orbiting Hubble Space Telescope and show the rapidly changing dust streams. It is not even known when P5 began displaying such unusual tails. Were the main belt asteroid struck by a large meteor, it would be expected to sport a single dust tail. Possible explanations include that light pressure from the Sun is causing the asteroid to rotate increasingly rapidly, which in turn causes pools of previously gravity-bound dust to spin off. Future observations should better indicate how P5 and its dust plumes are evolving and so provide more clues to its nature -- and to how many similar asteroids might exist.",
        "hdurl": "https://apod.nasa.gov/apod/image/1311/asteroidP5_hubble_3000.jpg",
        "media_type": "image",
        "service_version": "v1",
        "title": "The Unexpected Tails of Asteroid P5",
        "url": "https://apod.nasa.gov/apod/image/1311/asteroidP5_hubble_960.jpg"
      },
      {
        "userId": "user01",
        "date": "2017-04-22",
        "explanation": "On April 12, as the Sun was blocked by the disk of Saturn the Cassini spacecraft camera looked toward the inner Solar System and the gas giant's backlit rings. At the top of the mosaicked view is the A ring with its broader Encke and narrower Keeler gaps visible. At the bottom is the F ring, bright due to the viewing geometry.  The point of light between the rings is Earth, 1.4 billion kilometers in the distance. Look carefully and you can even spot Earth's large moon, a pinprick of light to the planet's left. Today Cassini makes its final close approach to Saturn's own large moon Titan, using Titan's gravity to swing into the spacecraft's Grand Finale, the final set of orbits that will bring Cassini just inside Saturn's rings.  Celebrate Earth Day: Adopt the Planet",
        "hdurl": "https://apod.nasa.gov/apod/image/1704/PIA21445.jpg",
        "media_type": "image",
        "service_version": "v1",
        "title": "Between the Rings",
        "url": "https://apod.nasa.gov/apod/image/1704/PIA21445.croplevels.jpg"
      },
      {
        "userId": "user01",
        "copyright": "\nJ. B. Kaler \n(UIUC)\n",
        "date": "2000-08-07",
        "explanation": "A planet has been found orbiting a Sun-like star only 10 light-years away.  No direct picture of the planet was taken - the planet was discovered by the gravitational wobble it created on its parent star, Epsilon Eridani.  The discovery marks the closest Sun-like star yet found to house an extra-solar planet.  Pictured above, the star Epsilon Eridani is visible near the belt of Orion to the unaided eye.  The detected planet is thought to have a mass like Jupiter but orbit slightly closer in.  The elliptical nature of the planet's orbit raises questions about whether the nearly circular orbits of planets in our own Solar System are relatively uncommon. It is unknown whether other planets exist around Epsilon Eridani.",
        "hdurl": "https://apod.nasa.gov/apod/image/0008/epseri_kaler_big.jpg",
        "media_type": "image",
        "service_version": "v1",
        "title": "Nearby Star Episilon Eridani Has a Planet",
        "url": "https://apod.nasa.gov/apod/image/0008/epseri_kaler.jpg"
      },
      {
        "userId": "user01",
        "date": "2010-11-04",
        "explanation": "Constellations of lights sprawl across this night scene, but they don't belong in the skies of planet Earth. Instead, the view looks down from the International Space Station as it passed over the United States along the northern Gulf Coast on October 29. A Russian Soyuz spacecraft is docked in the foreground. Behind its extended solar panels, some 360 kilometers below, are the recognizable city lights of New Orleans. Looking east along the coast to the top of the frame finds Mobile, Alabama while Houston city lights stand out to the west, toward the bottom. North (left) of New Orleans, a line of lights tracing central US highway I55 connects to Jackson, Mississippi and Memphis, Tennessee. Of course, the lights follow the population centers, but not everyone lives on planet Earth all the time these days. November 2nd marked the first decade of continuous human presence in space on board the International Space Station.  EPOXI mission spacecraft encounters comet Hartley 2",
        "hdurl": "https://apod.nasa.gov/apod/image/1011/iss025e010008.jpg",
        "media_type": "image",
        "service_version": "v1",
        "title": "Night Lights",
        "url": "https://apod.nasa.gov/apod/image/1011/iss025e010008_900c.jpg"
      },
      {
        "userId": "user01",
        "date": "2007-01-31",
        "explanation": "What would the rings of Saturn look like if you passed right through the ring plane? To find out, NASA aimed cameras from the Cassini spacecraft right at Saturn's rings as the robotic explorer passed from the sunlit side of the rings to the shadowed side.   Resulting images from a vantage point outside the rings and most moons, but inside the orbit of Titan, have been gathered together in the above time-lapse movie.  The dramatic movie demonstrates that ring particle density and reflectivity makes some parts of the shadowed side nearly the photographic negative of the sunlit side, but nearly empty regions remain continually dark.  Visible also are Saturn-orbiting moons Enceladus, Mimas, Janus, Epimetheus, Prometheus, and Pandora.  The extreme thinness of Saturn's rings can be appreciated from frames taken near the crossing time.",
        "hdurl": "https://apod.nasa.gov/apod/image/0701/ringcross_cassini.gif",
        "media_type": "image",
        "service_version": "v1",
        "title": "Movie: Cassini Crosses Saturn's Ring Plane",
        "url": "https://apod.nasa.gov/apod/image/0701/ringcross_cassini.jpg"
      },
      {
        "userId": "user01",
        "copyright": "Máximo Ruiz",
        "date": "2013-07-25",
        "explanation": "The beautiful Trifid Nebula is a cosmic study in contrasts. Also known as M20, it lies about 5,000 light-years away toward the nebula rich constellation Sagittarius. A star forming region in the plane of our galaxy, the Trifid illustrates three different types of astronomical nebulae; red emission nebulae dominated by light emitted by hydrogen atoms, blue reflection nebulae produced by dust reflecting starlight, and dark nebulae where dense dust clouds appear in silhouette. The bright red emission region, roughly separated into three parts by obscuring dust lanes, lends the Trifid its popular name. But in this sharp, colorful scene, the red emission is also surrounded by the the telltale blue haze of reflection nebulae. Pillars and jets sculpted by newborn stars, below and left of the emission nebula's center, appear in Hubble Space Telescope close-up images of the region. The Trifid Nebula is about 40 light-years across.",
        "hdurl": "https://apod.nasa.gov/apod/image/1307/m20_ruiz1024.jpg",
        "media_type": "image",
        "service_version": "v1",
        "title": "The Beautiful Trifid",
        "url": "https://apod.nasa.gov/apod/image/1307/m20_ruiz900.jpg"
      },
      {
        "userId": "user01",
        "copyright": "\nBrad Riza\n",
        "date": "2010-06-28",
        "explanation": "What's happened to the Moon? This past weekend, once again, part of the Moon moved through the Earth's shadow. This happens about once or twice a year, on the average, but not each month since the Moon's orbit around the Earth is slightly tilted. Pictured above, the face of a full moon is partly blocked by Earth's clouds, and partly darkened on the upper right by Earth's umbral shadow. Clouds permitting, the partial lunar eclipse was visible from the half of the Earth facing the Moon at the time of the eclipse, which included much of Earth's Pacific Rim.  On July 11, a total eclipse of the Sun will be visible in a thin swath of Earth crossing the southern Pacific Ocean.",
        "hdurl": "https://apod.nasa.gov/apod/image/1006/partialeclipse_riza_big.jpg",
        "media_type": "image",
        "service_version": "v1",
        "title": "A Partial Lunar Eclipse",
        "url": "https://apod.nasa.gov/apod/image/1006/partialeclipse_riza.jpg"
      },
      {
        "userId": "user01",
        "date": "2003-09-22",
        "explanation": "Next stop: Mars.  Two months ago, the second of two missions to Mars was launched from Cape Canaveral, Florida, USA above a Boeing Delta II rocket. The Mars Exploration Rover dubbed Opportunity is expected to arrive at the red planet this coming January.  Pictured above, an attached RocketCam (TM) captures Opportunity separating from lower booster stages and rocketing off toward Mars. Upon arriving, parachutes will deploy to slow the spacecraft and surrounding airbags will inflate.  The balloon-like package will then bounce around the surface a dozen times or more before coming to a stop.  The airbags will then deflate, the spacecraft will right itself, and the Opportunity rover will prepare to roll onto Mars.  A first rover named Spirit was successfully launched on June 10 and will arrive at Mars a few weeks earlier.  The robots Spirit and Opportunity are expected to cover as much as 40 metres per day, much more than Sojourner, their 1997 predecessor.  Spirit and Opportunity will search for evidence of ancient Martian water, from which implications might be drawn about the possibility of ancient Martian life.",
        "hdurl": "https://apod.nasa.gov/apod/image/0309/launchmerb_ecliptic_big.gif",
        "media_type": "image",
        "service_version": "v1",
        "title": "Opportunity Rockets Toward Mars",
        "url": "https://apod.nasa.gov/apod/image/0309/launchmerb_ecliptic.gif"
      }
  ],
  "blocked": [
    {
      "userId": "user01",
      "date": "2023-01-01",
      "explanation": "This is an explanation for item 1.",
      "hdurl": "https://example.com/hdimage1.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Stunning view of the galaxy",
      "url": "https://example.com/image1.jpg"
    },
    {
      "userId": "user02",
      "date": "2023-01-01",
      "explanation": "This is an explanation for item 1.",
      "hdurl": "https://example.com/hdimage1.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Stunning view of the galaxy",
      "url": "https://example.com/image1.jpg"
    },
    {
      "userId": "user03",
      "date": "2023-01-01",
      "explanation": "This is an explanation for item 1.",
      "hdurl": "https://example.com/hdimage1.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Stunning view of the galaxy",
      "url": "https://example.com/image1.jpg"
    },
    {
      "userId": "user04",
      "date": "2023-01-01",
      "explanation": "This is an explanation for item 1.",
      "hdurl": "https://example.com/hdimage1.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Stunning view of the galaxy",
      "url": "https://example.com/image1.jpg"
    },
    {
      "userId": "user05",
      "date": "2023-01-01",
      "explanation": "This is an explanation for item 1.",
      "hdurl": "https://example.com/hdimage1.jpg",
      "media_type": "image",
      "service_version": "v1",
      "title": "Stunning view of the galaxy",
      "url": "https://example.com/image1.jpg"
    }
  ]
}